## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:119" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:119" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:e9317837439aa03ecf41c909f2d23521c71950c224f812845858f73376fb6fd0" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:78f092b4ec54d4dd6166092f06862a669e36ad2ae4a8d9108feb37c0dafd9d82"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 119 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/graphql.9aec4e89c018919741d557f4baa1d761.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "aa58d7f2c1123b3ad7048bce2dd4c377-6" -> "eff8dc6eb158ef17f7a056ded17d7653"
      ~ id                     = "graphql.9aec4e89c018919741d557f4baa1d761.zip" -> (known after apply)
      ~ key                    = "graphql.9aec4e89c018919741d557f4baa1d761.zip" -> "graphql.eff8dc6eb158ef17f7a056ded17d7653.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "9aec4e89c018919741d557f4baa1d761" -> "eff8dc6eb158ef17f7a056ded17d7653"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "bkBMIwJkw_gnOf34tIWtMvjIMgTKN8dT" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "abe4a6ad1f2636ab36ece0e0675061ee"
      ~ id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip" -> (known after apply)
      ~ key                    = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip" -> "processValidationJson.abe4a6ad1f2636ab36ece0e0675061ee.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "49f6291dc84bb27b95f10c7de8148425" -> "abe4a6ad1f2636ab36ece0e0675061ee"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "LqNn0nLdI5zQnrBefvVU.H5YSpadpr41" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.4dddc5f9f276f3dcc9b5a031956e48a5.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "957f22b5d2df1a87d5ec3e1655dd7fe8-4" -> "f7e91a089013aff2b5a16a65913d9d67"
      ~ id                     = "python.4dddc5f9f276f3dcc9b5a031956e48a5.zip" -> (known after apply)
      ~ key                    = "python.4dddc5f9f276f3dcc9b5a031956e48a5.zip" -> "python.f7e91a089013aff2b5a16a65913d9d67.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "4dddc5f9f276f3dcc9b5a031956e48a5" -> "f7e91a089013aff2b5a16a65913d9d67"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "VFOSWY1dmjhZ3g2n2sBqyGzUlu1HYDvB" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "88c17b493c18051bcc2aaaed53db770e" -> "7c8e235cf3ac43537ed7fade79859d1e"
        id                     = "dist/200.html"
      ~ source_hash            = "88c17b493c18051bcc2aaaed53db770e" -> "7c8e235cf3ac43537ed7fade79859d1e"
        tags                   = {}
      ~ version_id             = "_VIC8Rg6o_eLY11JrxyNi6RVDYjLkLcR" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b5d414102cd29cab5702792293e9e118" -> "5a79e511e5916a337a0dafae8dae3c1c"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "b5d414102cd29cab5702792293e9e118" -> "5a79e511e5916a337a0dafae8dae3c1c"
        tags                   = {}
      ~ version_id             = "Fc7eAzyyVxcsEcpry2rlXevYEQd.zNRH" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "4e948c1abb5cb874477d88fcc8985e93" -> "cdeb3432b90aa901ca09720ae0995a06"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "4e948c1abb5cb874477d88fcc8985e93" -> "cdeb3432b90aa901ca09720ae0995a06"
        tags                   = {}
      ~ version_id             = "BSssc4RDcy4egi4W.dsieI7rrvVNSn7A" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "88c17b493c18051bcc2aaaed53db770e" -> "7c8e235cf3ac43537ed7fade79859d1e"
        id                     = "dist/index.html"
      ~ source_hash            = "88c17b493c18051bcc2aaaed53db770e" -> "7c8e235cf3ac43537ed7fade79859d1e"
        tags                   = {}
      ~ version_id             = "veOzsrFwYQopHU6FRS7OVdp.2bayF6Po" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/css/app.2111aa3d.css"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/css"
+       etag                   = "18e564f5bf55a6ce1602066455738e22"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/css/app.2111aa3d.css"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/css/app.2111aa3d.css"
+       source_hash            = "18e564f5bf55a6ce1602066455738e22"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/css/app.536f125e.css"] will be destroyed
  # (because key ["static/css/app.536f125e.css"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/css/app.536f125e.css" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/css" -> null
-       etag                   = "728b583660f7d526b06e732d98cc3f0a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/css/app.536f125e.css" -> null
-       key                    = "dist/static/css/app.536f125e.css" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/css/app.536f125e.css" -> null
-       source_hash            = "728b583660f7d526b06e732d98cc3f0a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "iAV.Df2pTNrh4l8yynfrKiYDI2GU0t.E" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.2c6555fe.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.2c6555fe.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "9164a18e995519620d4df182f3648c27" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js" -> null
-       source_hash            = "9164a18e995519620d4df182f3648c27" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "X67J3sWmaZz3rpLPL8DLQURZ9LF9vI8R" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "55d3003fc652eef3fccd962d62d4f328" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.2c6555fe.chunk.js.LICENSE.txt" -> null
-       source_hash            = "55d3003fc652eef3fccd962d62d4f328" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "evs0IXyyjysSuq1DNzLhFRHFAyYl_ftJ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.54e42627.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "b4b155707450307efed07a11d4b82295"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.54e42627.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.54e42627.chunk.js"
+       source_hash            = "b4b155707450307efed07a11d4b82295"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.54e42627.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "55d3003fc652eef3fccd962d62d4f328"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.54e42627.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.54e42627.chunk.js.LICENSE.txt"
+       source_hash            = "55d3003fc652eef3fccd962d62d4f328"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.0f81b860.chunk.js"] will be destroyed
  # (because key ["static/js/OrganizationOrganizationsPage.0f81b860.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/OrganizationOrganizationsPage.0f81b860.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "a662b6a5259ca16470ea2afeef0eb2c8" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationOrganizationsPage.0f81b860.chunk.js" -> null
-       key                    = "dist/static/js/OrganizationOrganizationsPage.0f81b860.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.0f81b860.chunk.js" -> null
-       source_hash            = "a662b6a5259ca16470ea2afeef0eb2c8" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "SXhRaIelXBFZ9y6T_3T6rn2P8r9KP9Zd" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.0f81b860.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/OrganizationOrganizationsPage.0f81b860.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/OrganizationOrganizationsPage.0f81b860.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "ed5f295167ceab5c497248391619c11e" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/OrganizationOrganizationsPage.0f81b860.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/OrganizationOrganizationsPage.0f81b860.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.0f81b860.chunk.js.LICENSE.txt" -> null
-       source_hash            = "ed5f295167ceab5c497248391619c11e" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "C9YrkaVg9g4jslf6KJEeFeKj3OqX38qk" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.38288e19.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "7c1fddc1eebc31130d6ad43fc20f3747"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationOrganizationsPage.38288e19.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.38288e19.chunk.js"
+       source_hash            = "7c1fddc1eebc31130d6ad43fc20f3747"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/OrganizationOrganizationsPage.38288e19.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "ed5f295167ceab5c497248391619c11e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/OrganizationOrganizationsPage.38288e19.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/OrganizationOrganizationsPage.38288e19.chunk.js.LICENSE.txt"
+       source_hash            = "ed5f295167ceab5c497248391619c11e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodReportingPeriodsPage.89c2a847.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "1dfb71f273a1a34cbd829c2c123559e8"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ReportingPeriodReportingPeriodsPage.89c2a847.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodReportingPeriodsPage.89c2a847.chunk.js"
+       source_hash            = "1dfb71f273a1a34cbd829c2c123559e8"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodReportingPeriodsPage.89c2a847.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "6d03c728fab30aebeef8d15c077f7d8c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/ReportingPeriodReportingPeriodsPage.89c2a847.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodReportingPeriodsPage.89c2a847.chunk.js.LICENSE.txt"
+       source_hash            = "6d03c728fab30aebeef8d15c077f7d8c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js"] will be destroyed
  # (because key ["static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "620019d5f4290b5bfd4436676a4231a7" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js" -> null
-       key                    = "dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js" -> null
-       source_hash            = "620019d5f4290b5bfd4436676a4231a7" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "UhjziEN26dAcCKi1iC2hC_8YWDHDSoNJ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "6d03c728fab30aebeef8d15c077f7d8c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/ReportingPeriodReportingPeriodsPage.a83714e8.chunk.js.LICENSE.txt" -> null
-       source_hash            = "6d03c728fab30aebeef8d15c077f7d8c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "y76x1ON_3aZ2XCgKNynd4dX0BeYNCQ1L" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.08836cba.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "0300200d991e8520c351708db140b2ad"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.08836cba.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.08836cba.chunk.js"
+       source_hash            = "0300200d991e8520c351708db140b2ad"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.08836cba.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "efea1edc51440599026956ce53a048e0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.08836cba.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.08836cba.chunk.js.LICENSE.txt"
+       source_hash            = "efea1edc51440599026956ce53a048e0"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.47fd71b3.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadPage.47fd71b3.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadPage.47fd71b3.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "cc4dc53510f99d8567e4d1db42c9b887" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.47fd71b3.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadPage.47fd71b3.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.47fd71b3.chunk.js" -> null
-       source_hash            = "cc4dc53510f99d8567e4d1db42c9b887" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "LdRz0eel7y4BqtdxT5uiQ6EifYuwIvZQ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "efea1edc51440599026956ce53a048e0" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.47fd71b3.chunk.js.LICENSE.txt" -> null
-       source_hash            = "efea1edc51440599026956ce53a048e0" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "NTjjAnWjx9SobaN5gogdi1NuNl__6oNk" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bd84241f.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d79b7ebb36b53d14bf21fe6cbbaa6ecc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.bd84241f.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bd84241f.chunk.js"
+       source_hash            = "d79b7ebb36b53d14bf21fe6cbbaa6ecc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.bd84241f.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "43ff778014632a7ef9766fd4374290b4"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadsPage.bd84241f.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.bd84241f.chunk.js.LICENSE.txt"
+       source_hash            = "43ff778014632a7ef9766fd4374290b4"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.d006aac9.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.d006aac9.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadsPage.d006aac9.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "ef1d00af6ff4704916f223a344b437d6" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.d006aac9.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadsPage.d006aac9.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.d006aac9.chunk.js" -> null
-       source_hash            = "ef1d00af6ff4704916f223a344b437d6" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "PHUZhlLGrMPsebgxkYRcY_gJQKAv3xBa" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "43ff778014632a7ef9766fd4374290b4" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadsPage.d006aac9.chunk.js.LICENSE.txt" -> null
-       source_hash            = "43ff778014632a7ef9766fd4374290b4" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "r.ZgJekHd1ee1tffSoJmVlYIn.riicfK" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.7f74e430.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "0eea380e4084a616e34baed55dcac699"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUsersPage.7f74e430.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.7f74e430.chunk.js"
+       source_hash            = "0eea380e4084a616e34baed55dcac699"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.7f74e430.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "c6fdde5760bf5d008d4ac72ddd13b210"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUsersPage.7f74e430.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.7f74e430.chunk.js.LICENSE.txt"
+       source_hash            = "c6fdde5760bf5d008d4ac72ddd13b210"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.e7e98a14.chunk.js"] will be destroyed
  # (because key ["static/js/UserUsersPage.e7e98a14.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UserUsersPage.e7e98a14.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "ed2df3cc8956f0c4092991a7e347803c" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUsersPage.e7e98a14.chunk.js" -> null
-       key                    = "dist/static/js/UserUsersPage.e7e98a14.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.e7e98a14.chunk.js" -> null
-       source_hash            = "ed2df3cc8956f0c4092991a7e347803c" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "z7nx80.IxVRnObhRo1BVe.YU9a._xeNS" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.e7e98a14.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserUsersPage.e7e98a14.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UserUsersPage.e7e98a14.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "c6fdde5760bf5d008d4ac72ddd13b210" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUsersPage.e7e98a14.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserUsersPage.e7e98a14.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.e7e98a14.chunk.js.LICENSE.txt" -> null
-       source_hash            = "c6fdde5760bf5d008d4ac72ddd13b210" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ZqFS9p4ycKcvj9GdF3GesADq.NV9RU6I" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.ea96bace.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "e137dfb714e0c34fc2aa8d21a62f0584"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.ea96bace.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.ea96bace.js"
+       source_hash            = "e137dfb714e0c34fc2aa8d21a62f0584"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.ea96bace.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "1cba5d22c9f34333d1514d887d4f905f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.ea96bace.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.ea96bace.js.LICENSE.txt"
+       source_hash            = "1cba5d22c9f34333d1514d887d4f905f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.f1dbe611.js"] will be destroyed
  # (because key ["static/js/app.f1dbe611.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.f1dbe611.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c967e1ee64eb09835a9c99b6e1e07924" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.f1dbe611.js" -> null
-       key                    = "dist/static/js/app.f1dbe611.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.f1dbe611.js" -> null
-       source_hash            = "c967e1ee64eb09835a9c99b6e1e07924" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "wFAGoonBFt5RIO1pq.OApc5iF1Gmkzdg" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.f1dbe611.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.f1dbe611.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.f1dbe611.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.f1dbe611.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.f1dbe611.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.f1dbe611.js.LICENSE.txt" -> null
-       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ybyvwFRpts61s2sNRzWnT2kL6ENhlvKM" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.f2cbb642.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "70b85bbf3360e08314dc1e6903da42e5"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.f2cbb642.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.f2cbb642.js"
+       source_hash            = "70b85bbf3360e08314dc1e6903da42e5"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.fe0c3d88.js"] will be destroyed
  # (because key ["static/js/runtime-app.fe0c3d88.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/runtime-app.fe0c3d88.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c57d072f66f84fe21e54c557371ed258" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.fe0c3d88.js" -> null
-       key                    = "dist/static/js/runtime-app.fe0c3d88.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.fe0c3d88.js" -> null
-       source_hash            = "c57d072f66f84fe21e54c557371ed258" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "KSg2.J9M0MGD5wbq5NuhU5_l8TI2I2JU" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-29T15:46:14.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:86" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:86/invocations" -> (known after apply)
      ~ s3_key                         = "python.4dddc5f9f276f3dcc9b5a031956e48a5.zip" -> "python.f7e91a089013aff2b5a16a65913d9d67.zip"
        tags                           = {}
      ~ version                        = "86" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "063a1483ecf79b79dc4cc2ead2fd3c8e8359cd56" -> "2e160e46199df1c5ce5521389352d63570a83c4b"
              ~ "DD_TAGS"                      = "git.commit.sha:063a1483ecf79b79dc4cc2ead2fd3c8e8359cd56,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2e160e46199df1c5ce5521389352d63570a83c4b,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "063a1483ecf79b79dc4cc2ead2fd3c8e8359cd56" -> "2e160e46199df1c5ce5521389352d63570a83c4b"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "86" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-04-29T15:46:14.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:134" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:134/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.9aec4e89c018919741d557f4baa1d761.zip" -> "graphql.eff8dc6eb158e...*[Comment body truncated]*